Revit 2024 API
ExternalResourceTypes.BuiltInExternalResourceTypes.DWFMarkup Property
 An external resource type representing DWF markups data. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalResourceType DWFMarkup { get; }
Visual Basic
Public Shared ReadOnly Property DWFMarkup As ExternalResourceType
	Get
Visual C++
public:
static property ExternalResourceType^ DWFMarkup {
	ExternalResourceType^ get ();
}
See Also
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace